Documents/ПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаявкаНаРасходованиеДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеСРасчетногоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйКонтролироватьЗаполнениеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовПоНачислению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийСписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеСРасчетногоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалоговИВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПлатежноеПоручениеИсходящее/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);	
	ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
	Если ЭтоНовый() Тогда
		СлужебныйКонтролироватьЗаполнениеЗаявки = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		
		ФинансыСервер.ПроверитьВозможностьВводаНаОснованииЗаявки(ДанныеЗаполнения, Ложь);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,
			"Договор, Контрагент, НазначениеПлатежа, Организация, Подразделение, 
			| Статья, СтатьяРасходов, СтатьяРасходовПоНачислению, Счет, СчетКонтрагента, 
			| ИдентификаторПлатежа, ПеречислениеВБюджет, СтатусСоставителя, КодБК, КодОКАТО, 
			| ПоказательОснования, ПоказательПериода, ПоказательНомера, ПоказательДаты, ПоказательТипа,
			| ТипПлатежногоДокумента, ОчередностьПлатежа,
			| СтавкаНДС, СуммаНДС, ПериодРегистрации"); //, ВидНачисления");  //#6576
		ВидОперации = ДанныеЗаполнения.ВидОперацииСРС;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Валюта = ДанныеЗаполнения.ВалютаДокумента;
		Основание = ДанныеЗаполнения;
		
		Если ДанныеЗаполнения.ЖелательнаяДатаПлатежа <> Дата(1,1,1) Тогда
			Дата = ДанныеЗаполнения.ЖелательнаяДатаПлатежа;
		КонецЕсли;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.ЗарплатаСотрудникам Цикл
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		Для каждого ЭлементТЗ из ДанныеЗаполнения.РаспределениеПлатежа Цикл
			НоваяСтрока = РаспределениеПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента; //ДанныеЗаполнения.Контрагент.ОсновнойДоговор; #11702
		Организация = ДанныеЗаполнения.Организация;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
		
		ИсхДата = ТекущаяДатаСеанса();
		НазначениеПлатежа = "По " + Строка(Договор) + ". Сумма " + Формат(Сумма, "ЧДЦ=2; ЧРД=-; ЧГ=0" ) + ". Без налога (НДС)";
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента; //ДанныеЗаполнения.Контрагент.ОсновнойДоговор; #11702
		Организация = ДанныеЗаполнения.Организация;
		Сумма = ДанныеЗаполнения.СуммаДокумента;
		Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
		
		ИсхДата = ТекущаяДатаСеанса();
		НазначениеПлатежа = "По " + Строка(Договор) + ". Сумма " + Формат(Сумма, "ЧДЦ=2; ЧРД=-; ЧГ=0" ) + ". Без налога (НДС)";

		//заполнение распределения
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения.Ссылка;
		НоваяСтрока.Сумма = ДанныеЗаполнения.СуммаДокумента;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ТипЗнч(ДанныеЗаполнения.Ссылка) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам;
			Основание = ДокументОснование.Ссылка;
			Организация = ДокументОснование.Организация;
			ОчередностьПлатежа = 3;
			ПериодРегистрации = ДокументОснование.ПериодРегистрации;
			
			ВременнаяТаблица = Новый ТаблицаЗначений;
			ВременнаяТаблица.Колонки.Добавить("Сотрудник");	
			//ВременнаяТаблица.Колонки.Добавить("ВидНачисления");  //#6576
			ВременнаяТаблица.Колонки.Добавить("Сумма");			
			
			Для Каждого ТекущаяСтрока Из ДокументОснование.Начисление Цикл
				НоваяСтрока = ВременнаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
			//#6576
			//ВременнаяТаблица.Свернуть("Сотрудник, ВидНачисления", "Сумма");
	        ВременнаяТаблица.Свернуть("Сотрудник", "Сумма");
			
			Для Каждого ТекСотрудник из ВременнаяТаблица Цикл
				НоваяСтрока = ЗарплатаСотрудникам.Добавить();
				НоваяСтрока.Сотрудник = ТекСотрудник.Сотрудник;
				//НоваяСтрока.УДАЛИТЬ_ВидНачисления = ТекСотрудник.ВидНачисления; //#6576
				НоваяСтрока.Сумма = ТекСотрудник.Сумма;
				НоваяСтрока.СчетСотрудника = ФинансыСервер.ПолучитьСчетСотрудника(НоваяСтрока.Сотрудник);
			КонецЦикла;		
		КонецЕсли;	
	КонецЕсли;
	
	ФинансыСервер.ДокументРасходаОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперации, Ложь);
	СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	
	Оплачено = Ложь;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеПериодРегистрацииОбязательно = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) И ПолеПериодРегистрацииОбязательно 
		И (ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не указан Период регистрации!'"), ,
        	"ОтображениеПериодаРегистрации",,Отказ);	
	КонецЕсли;
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю // №12420
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
		//ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам //#13333 закомментировано
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику
	Тогда
		   	ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;	
	
	//++ №12420
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю
		Или ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов
	Тогда
		ПроверяемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	//-- №12420
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПеречислениеВБюджет Тогда
		СтатусСоставителя = "";
		КодБК = "";
		КодОКАТО = "";
		ПоказательОснования = "";
		ПоказательПериода = "";
		ПоказательНомера = "";
		ПоказательДаты = "";
		ПоказательТипа = "";
	КонецЕсли;
		
	ФинансыСервер.ПроверитьЗаполнениеНаОснованииЗаявкиНаРасходование(ЭтотОбъект, Отказ, РежимЗаписи);

	ФинансыСервер.ДокументРасходаПередЗаписью(ЭтотОбъект, Ложь, ВидОперации, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Организация)
		И Не ЗначениеЗаполнено(СтавкаНДС)
		И ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(ЭтотОбъект, УчитыватьНДС);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
